#ifndef _DA790_H_
#define _DA790_H_

#include "common.h"
#include "code0/data/modelinfo.h"

typedef struct
{
    /*0x00*/ f32 unk0;
    /*0x04*/ f32 unk4;
    /*0x08*/ f32 unk8;
    /*0x0C*/ u8 unused[12];
    /*0x18*/ s16 unk18;
}_DA790UnkStruct1;

typedef struct {
    /*0x00*/ u8 unk0;
    /*0x02*/ s16 unk2; /*count of unk4/unk8*/
    /*0x04*/ ModelInfo **unk4;
    /*0x08*/ _DA790UnkStruct1 *unk8;
}_DA790UnkStruct2;

extern _DA790UnkStruct2 D_800DA0D0;
extern _DA790UnkStruct2 D_800DA0DC;
extern _DA790UnkStruct2 D_800DA0E8;
extern _DA790UnkStruct2 D_800DA0F4;
extern _DA790UnkStruct2 D_800DA100;
extern _DA790UnkStruct2 D_800DA10C;
extern _DA790UnkStruct2 D_800DA118;
extern _DA790UnkStruct2 D_800DA124;
extern _DA790UnkStruct2 D_800DA130;
extern _DA790UnkStruct2 D_800DA13C;
extern _DA790UnkStruct2 D_800DA148;
extern _DA790UnkStruct2 D_800DA154;
extern _DA790UnkStruct2 D_800DA160;
extern _DA790UnkStruct2 D_800DA16C;
extern _DA790UnkStruct2 D_800DA178;
extern _DA790UnkStruct2 D_800DA184;
extern _DA790UnkStruct2 D_800DA190;
extern _DA790UnkStruct2 D_800DA19C;
extern _DA790UnkStruct2 D_800DA370;
extern _DA790UnkStruct2 D_800DA37C;
extern _DA790UnkStruct2 D_800DA388;
extern _DA790UnkStruct2 D_800DA394;
extern _DA790UnkStruct2 D_800DA3A0;
extern _DA790UnkStruct2 D_800DA3AC;
extern _DA790UnkStruct2 D_800DA3B8;
extern _DA790UnkStruct2 D_800DA3C4;
extern _DA790UnkStruct2 D_800DA3D0;
extern _DA790UnkStruct2 D_800DA3DC;
extern _DA790UnkStruct2 D_800DA3E8;
extern _DA790UnkStruct2 D_800DA3F4;
extern _DA790UnkStruct2 D_800DA400;
extern _DA790UnkStruct2 D_800DA40C;
extern _DA790UnkStruct2 D_800DA418;
extern _DA790UnkStruct2 D_800DA5D4;
extern _DA790UnkStruct2 D_800DA7A0;
extern _DA790UnkStruct2 D_800DA7AC;
extern _DA790UnkStruct2 D_800DA7B8;
extern _DA790UnkStruct2 D_800DA7C4;
extern _DA790UnkStruct2 D_800DA7D0;
extern _DA790UnkStruct2 D_800DA7DC;
extern _DA790UnkStruct2 D_800DA7E8;
extern _DA790UnkStruct2 D_800DA7F4;
extern _DA790UnkStruct2 D_800DA800;
extern _DA790UnkStruct2 D_800DA80C;
extern _DA790UnkStruct2 D_800DA818;
extern _DA790UnkStruct2 D_800DA824;
extern _DA790UnkStruct2 D_800DA830;
extern _DA790UnkStruct2 D_800DA83C;
extern _DA790UnkStruct2 D_800DA848;
extern _DA790UnkStruct2 D_800DA854;
extern _DA790UnkStruct2 D_800DA860;
extern _DA790UnkStruct2 D_800DA86C;
extern _DA790UnkStruct2 D_800DA878;
extern _DA790UnkStruct2 D_800DA884;
extern _DA790UnkStruct2 D_800DA890;
extern _DA790UnkStruct2 D_800DA89C;
extern _DA790UnkStruct2 D_800DA8A8;
extern _DA790UnkStruct2 D_800DA8B4;
extern _DA790UnkStruct2 D_800DA8C0;
extern _DA790UnkStruct2 D_800DA8CC;
extern _DA790UnkStruct2 D_800DA8D8;
extern _DA790UnkStruct2 D_800DA8E4;
extern _DA790UnkStruct2 D_800DA8F0;
extern _DA790UnkStruct2 D_800DA8FC;
extern _DA790UnkStruct2 D_800DA908;
extern _DA790UnkStruct2 D_800DA914;
extern _DA790UnkStruct2 D_800DA920;
extern _DA790UnkStruct2 D_800DA92C;
extern _DA790UnkStruct2 D_800DA938;
extern _DA790UnkStruct2 D_800DA944;
extern _DA790UnkStruct2 D_800DA950;
extern _DA790UnkStruct2 D_800DA95C;
extern _DA790UnkStruct2 D_800DA968;
extern _DA790UnkStruct2 D_800DA974;
extern _DA790UnkStruct2 D_800DAA60;
extern _DA790UnkStruct2 D_800DB6B0;
extern _DA790UnkStruct2 D_800DB6BC;
extern _DA790UnkStruct2 D_800DB6C8;
extern _DA790UnkStruct2 D_800DB6D4;
extern _DA790UnkStruct2 D_800DB6E0;
extern _DA790UnkStruct2 D_800DB6EC;
extern _DA790UnkStruct2 D_800DB6F8;
extern _DA790UnkStruct2 D_800DB7B8;
extern _DA790UnkStruct2 D_800DB7C4;
extern _DA790UnkStruct2 D_800DB7D0;
extern _DA790UnkStruct2 D_800DB7DC;
extern _DA790UnkStruct2 D_800DB860;
extern _DA790UnkStruct2 D_800DB86C;
extern _DA790UnkStruct2 D_800DBACC;
extern _DA790UnkStruct2 D_800DBC68;
extern _DA790UnkStruct2 D_800DBE5C;
extern _DA790UnkStruct2 D_800DC148;
extern _DA790UnkStruct2 D_800DC1EC;
extern _DA790UnkStruct2 D_800DC1F8;
extern _DA790UnkStruct2 D_800DC4E8;
extern _DA790UnkStruct2 D_800DC848;
extern _DA790UnkStruct2 D_800DC9E8;

#endif
