#include "common.h"
#include "code0/main.h"
#include "code0/audio.h"
#include "code0/engine.h"
#include "code0/pragmas.h"
#include "code0/FDE0.h"
#include "code0/37090.h"
#include "code0/41940.h"
#include "code0/6ACA0.h"
#include "code0/7BA50.h"
#include "code0/87010.h"
#include "code0/A06F0.h"
#include "code0/8EFE0.h"
#include "code0/code0.h"
#include "code1/code1.h"
#include "code1/EB300.h"

DECL_STATIC_SEG_SYM(D_0100F1E0);

typedef void (*unkFuncPointer)(s32 spritenum, s32 arg1);

typedef struct
{
    /*0x00*/ s16 unk0;  /*spritenum?*/
    /*0x02*/ s16 unk2;  /*pad?*/
    /*0x04*/ s32 unk4;  /*x?*/
    /*0x08*/ s32 unk8;  /*y?*/
    /*0x0C*/ s32 unkC;  /*z?*/
    /*0x10*/ s32 unk10; /*x?*/
    /*0x14*/ s32 unk14; /*y?*/
    /*0x18*/ s32 unk18; /*z?*/
    /*0x1C*/ u8 unk1C;
    /*0x1D*/ u8 unk1D;
} _41940UnkStruct1;

/*.data*/
/*800DEF14*/ EXTERN_DATA STATIC s32 D_800DEF14; /*damage?*/
/*800DEF18*/ EXTERN_DATA STATIC s32 D_800DEF18; /*damage?*/
/*800DEF38*/ EXTERN_DATA STATIC s32 D_800DEF38;
/*800DEE80*/ EXTERN_DATA s32 D_800DEE80; /*spritenum?*/
/*800DEE84*/ EXTERN_DATA s32 D_800DEE84;
/*800DEE88*/ EXTERN_DATA s32 D_800DEE88;
/*800DEE8C*/ EXTERN_DATA s32 D_800DEE8C;
/*800DEE9C*/ EXTERN_DATA s32 D_800DEE9C;
/*800DEEA0*/ EXTERN_DATA s32 D_800DEEA0;
/*800DEEA8*/ EXTERN_DATA s32 gAiDebugGvar1;
/*800DEEAC*/ EXTERN_DATA s32 gAiDebugGvar2;
/*800DEEB0*/ EXTERN_DATA s32 gAiDebugGvar3;
/*800DEEB8*/ EXTERN_DATA s32 D_800DEEB8;
/*800DEEC0*/ EXTERN_DATA s32 gInvulnerability;
/*800DEED0*/ EXTERN_DATA u8 D_800DEED0[MAXPLAYERS];
/*800DEEE4*/ EXTERN_DATA u8 D_800DEEE4[MAXPLAYERS];
/*800DEEE8*/ EXTERN_DATA s32 gAutoAim;
/*800DEF1C*/ EXTERN_DATA s32 D_800DEF1C;
/*800DEF3C*/ EXTERN_DATA STATIC unkFuncPointer D_800DEF3C[84];
/*800DF1A8*/ EXTERN_DATA s32 D_800DF1A8;
