#include "common.h"
#include "code0/main.h"
#include "code0/audio.h"
#include "code0/graphics.h"
#include "code0/9410.h"
#include "code0/1E7A0.h"
#include "code0/41940.h"
#include "code0/7BA50.h"
#include "code0/code0.h"

typedef struct {
    /*0x00*/ s32 x[3];
    /*0x0C*/ s32 y[3];
    /*0x18*/ s32 z[3];
} _8EFE0UnkStruct2;

typedef struct {
    /*0x00*/ u8 unk0;
    /*0x02*/ u16 unk2;
    /*0x04*/ _8EFE0UnkStruct2 unk4;
    /*0x28*/ s32 unk28;
    /*0x2C*/ s32 unk2C;
} _8EFE0UnkStruct1;

/*.data*/
/*800E1750*/ EXTERN_DATA STATIC u8 D_800E1750[16];
/*800E1760*/ EXTERN_DATA STATIC s32 D_800E1760;

/*.comm*/
/*80106730*/ _8EFE0UnkStruct1 D_80106730[32] ALIGNED(16);
/*80139870*/ s32 D_80139870;
/*80197D20*/ _8EFE0UnkStruct2 D_80197D20 ALIGNED(8);
/*801A19F8*/ _8EFE0UnkStruct2 D_801A19F8 ALIGNED(8);

/*.text*/

/*8008E3E0*/
s32 func_8008E3E0(s32 x, s32 y, s32 z, s32 sectnum, s32 arg4, s32 arg5)
{
    SpriteType *spr;
    SpriteType *spr2;
    f32 fx1, fy1, fx2, fy2, fx3, fy3, f1;
    s16 spritenum;
    s32 i, j, k, l, m, n;
    s32 x1, y1, z1;

    i = 310;
    switch (arg4)
    {
    case 58:
        if (D_8012C470 == 1)
            i = 50;
        break;
    case 8:
    case 50:
    case 52:
    case 64:
    case 74:
        i = 50;
        break;
    case 30:
    case 41:
        i = 311;
        break;
    }

    if ((D_801AC9F4 > 0x100) && (i == 310))
        return -1;

    spritenum = func_80058934(x, y, z, sectnum, i);
