#include "common.h"
#include "string.h"
#include "code0/7FCE0.h"
#include "code0/controller.h"
#include "code0/code0.h"
#include "code1/code1.h"

#define CONTROLLER_EEPROM_LONG_READ 1
#define CONTROLLER_EEPROM_LONG_WRITE 2
#define CONTROLLER_PFS_NUM_FILES 3
#define CONTROLLER_PFS_FREE_BLOCKS 4
#define CONTROLLER_PFS_FILE_STATE 5
#define CONTROLLER_PFS_DELETE_FILE 6
#define CONTROLLER_PFS_INIT_PAK 7
#define CONTROLLER_PFS_REPAIR_ID 8
#define CONTROLLER_PFS_READ_WRITE_FILE 9
#define CONTROLLER_PFS_ALLOCATE_FILE 10
#define CONTROLLER_PFS_FIND_FILE 11
#define CONTROLLER_MOTOR_INIT 12
#define CONTROLLER_GET_STATUS 13
#define COMPANY_CODE 0x3458 /*4X*/

#if VERSION_US
#define __C__ 0xFF
#define GAMECODE 0x4E445A45 /*NDZE*/
#elif VERSION_FR
#define __C__ 0xC8
#define GAMECODE 0x4E445A50 /*NDZP*/
#endif

typedef struct {
    /*0x00*/ u32 unk0;
    /*0x04*/ u32 game_code;
    /*0x08*/ u16 company_code;
    /*0x0A*/ u8 ext_name[4];
    /*0x0E*/ u8 game_name[18];
} ControllerUnkStruct1;

typedef struct {
    /*0x00*/ u8 unk0;
    /*0x01*/ char unk1[17];
    /*0x12*/ char unk12[5];
} ControllerUnkStruct2;

/*.data*/
/*800E0F60*/ static char D_800E0F60[67] = "                0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ!\"#'*+,-./:=?@";
#if VERSION_US
/*800E0FA4*/ static char D_800E0FA4[30] = "If Rumble Paks are to be used";
/*800E0FC4*/ static char D_800E0FC4[24] = "please insert them into";
/*800E0FDC*/ static char D_800E0FDC[17] = "the Controllers.";
/*800E0FF0*/ static char D_800E0FF0[13] = "Delete Note?";
/*800E1000*/ static char D_800E1000[28] = "A = Continue without Saving";
/*800E101C*/ static char D_800E101C[7] = "A = No";
/*800E1024*/ static char D_800E1024[8] = "B = Yes";
/*800E102C*/ static char D_800E102C[10] = "Z = Retry";
/*800E1038*/ static char D_800E1038[8] = "B = Yes";
/*800E1040*/ static char D_800E1040[10] = "Z = Retry";
/*800E104C*/ static char D_800E104C[26] = "Controller Pak exchanged.";
/*800E1068*/ static char D_800E1068[21] = "Data checksum error.";
/*800E1080*/ static char D_800E1080[24] = "Controller reset error.";
