#include "common.h"
#include "string.h"
#include "code0/7FCE0.h"
#include "code0/controller.h"
#include "code0/code0.h"
#include "code1/code1.h"

/*TODO: include string.h from libkmc instead of libultra*/
s32 strcmp(const char *, const char *);

#define CONTROLLER_EEPROM_LONG_READ 1
#define CONTROLLER_EEPROM_LONG_WRITE 2
#define CONTROLLER_PFS_NUM_FILES 3
#define CONTROLLER_PFS_FREE_BLOCKS 4
#define CONTROLLER_PFS_FILE_STATE 5
#define CONTROLLER_PFS_DELETE_FILE 6
#define CONTROLLER_PFS_INIT_PAK 7
#define CONTROLLER_PFS_REPAIR_ID 8
#define CONTROLLER_PFS_READ_WRITE_FILE 9
#define CONTROLLER_PFS_ALLOCATE_FILE 10
#define CONTROLLER_PFS_FIND_FILE 11
#define CONTROLLER_MOTOR_INIT 12
#define CONTROLLER_GET_STATUS 13

typedef struct {
    /*0x00*/ u32 unk0;
    /*0x04*/ u32 game_code;
    /*0x08*/ u16 company_code;
    /*0x0A*/ char ext_name[4];
    /*0x0E*/ char game_name[18];
} ControllerUnkStruct1;

typedef struct {
    /*0x00*/ u8 unk0;
    /*0x01*/ char unk1[17];
    /*0x12*/ char unk12[5];
} ControllerUnkStruct2;

/*.data*/
/*800E0F60*/ EXTERN_DATA STATIC char D_800E0F60[67];
/*800E0FA4*/ EXTERN_DATA STATIC char D_800E0FA4[30];
/*800E0FC4*/ EXTERN_DATA STATIC char D_800E0FC4[24];
/*800E0FDC*/ EXTERN_DATA STATIC char D_800E0FDC[17];
/*800E0FF0*/ EXTERN_DATA STATIC char D_800E0FF0[13];
/*800E1000*/ EXTERN_DATA STATIC char D_800E1000[28];
/*800E101C*/ EXTERN_DATA STATIC char D_800E101C[7];
/*800E1024*/ EXTERN_DATA STATIC char D_800E1024[8];
/*800E1038*/ EXTERN_DATA STATIC char D_800E1038[8];
/*800E1040*/ EXTERN_DATA STATIC char D_800E1040[10];
/*800E104C*/ EXTERN_DATA STATIC char D_800E104C[26];
/*800E1068*/ EXTERN_DATA STATIC char D_800E1068[21];
/*800E1080*/ EXTERN_DATA STATIC char D_800E1080[24];
/*800E1098*/ EXTERN_DATA STATIC char D_800E1098[14];
/*800E10A8*/ EXTERN_DATA STATIC char D_800E10A8[25];
/*800E10C4*/ EXTERN_DATA STATIC char D_800E10C4[27];
/*800E10E0*/ EXTERN_DATA STATIC char D_800E10E0[15];
