#ifndef _MODELINFO_H_
#define _MODELINFO_H_

#include "common.h"

typedef struct
{
    /*0x00*/ s16 dimx;
    /*0x00*/ s16 dimy;
    /*0x04*/ s32 offset;
} ModelTileInfo;

typedef struct {
    /*0x00*/ s32 fileoff;
    /*0x04*/ u8 *ramaddr;
    /*0x08*/ s16 unk8;
    /*0x0A*/ s16 unkA;
} ModelInfoUnkStruct1;

typedef struct {
    /*0x00*/ s32 fileoff;
    /*0x04*/ u8 *ramaddr;
    /*0x08*/ u16 unk8;
    /*0x0A*/ u16 unkA;
    /*0x0C*/ u16 tileinfo;
    /*0x0E*/ u16 unkE; /*tileinfo end?*/
    /*0x10*/ u16 unk10;
    /*0x12*/ u16 unk12;
    /*0x14*/ u8 pad2[4];
    /*0x18*/ ModelInfoUnkStruct1 *unk18;
    /*0x1C*/ u8 pad3[4];
    /*0x20*/ s8 lock;
    /*0x21*/ u8 pad4[3];
    /*0x24*/ s16 unk24;
    /*0x26*/ s16 unk26;
    /*0x28*/ s16 unk28;
    /*0x2A*/ s16 unk2A;
    /*0x2C*/ s16 unk2C;
    /*0x2E*/ s16 unk2E;
} ModelInfo;

extern ModelInfoUnkStruct1 D_800BD790;
extern ModelInfo D_800BD79C;
extern ModelInfoUnkStruct1 D_800BD7CC;
extern ModelInfo D_800BD7D8;
extern ModelInfoUnkStruct1 D_800BD808;
extern ModelInfo D_800BD814;
extern ModelInfoUnkStruct1 D_800BD844;
extern ModelInfo D_800BD850;
extern ModelInfoUnkStruct1 D_800BD880;
extern ModelInfo D_800BD88C;
extern ModelInfoUnkStruct1 D_800BD8BC;
extern ModelInfo D_800BD8C8;
extern ModelInfoUnkStruct1 D_800BD8F8;
extern ModelInfo D_800BD904;
extern ModelInfoUnkStruct1 D_800BD934;
extern ModelInfo D_800BD940;
extern ModelInfoUnkStruct1 D_800BD970;
extern ModelInfo D_800BD97C;
extern ModelInfoUnkStruct1 D_800BD9AC;
extern ModelInfo D_800BD9B8;
extern ModelInfoUnkStruct1 D_800BD9E8;
extern ModelInfo D_800BD9F4;
extern ModelInfoUnkStruct1 D_800BDA24;
extern ModelInfo D_800BDA30;
extern ModelInfoUnkStruct1 D_800BDA60;
extern ModelInfo D_800BDA6C;
extern ModelInfoUnkStruct1 D_800BDA9C;
extern ModelInfo D_800BDAA8;
